app/Http/Controllers/RegisterController.php

    public function store()
    {
        $attributes = request()->validate([
            'name' => 'required|max:255',
            'username' => 'required|min:3|max:255|unique:users,username',
            'email' => 'required|email|max:255|unique:users,email',
            'password' => 'required|min:7|max:255',
        ]);

        auth()->login(User::create($attributes));
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('Samuel', 'Samuelsamuelganteng', 'ganteng@gmail.com', '$2y$10$BpJQaah6pEtmTp73WZoOwOTbdOfg/aFEx4.ZIwlafnZyqbRhKHXcS', '2023-07-12 05:14:11', '2023-07-12 05:14:11')